Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: འོད་འདོམ་གང་མཉམ་པ་དག་ཡིན་ནོ། །
en: (63) They have a symmetrical aureole of light, extending a full arm span.

source: འོད་ཀྱིས་གསལ་བར་མཛད་ཅིང་།
en: (64) Their luminosity radiates as they walk.

source: གཤེགས་པ་དག་ཡིན་ནོ། །ལྷ་དང་མི་གང་དག་དེ་དག་གི་སྐུ་མཐོང་བ་དེ་དག་ཚིམ་པར་འགྱུར་རོ། །
en: (65) They satisfy whichever gods and humans encounter them.

source: སྲོག་ཆགས་ཐམས་ཅད་ཀྱིས་མཐོང་ཡང་བརྙས་པར་མི་བྱེད་དོ། །
en: (66) They are never mistreated though visible to all creatures.

source: སེམས་ཅན་རྣམས་ལ་རྗེས་སུ་སྟོན་པར་མཛད་དོ། །
en: (67) They instruct sentient beings.

source: དེ་དག་གི་གསུང་ནི་འཁོར་དང་འཐུན་པར་ཁྱབ་པར་མཛད་ཀྱི་འཁོར་གྱི་ཕྱི་རོལ་དུ་གསུང་མི་འགྲོའོ། །
en: (68) Their speech is pervasive, in conformity with their assembly, but it does not extend outside their assembly.

source: རོ་སྟོད་སེང་གེ་ལྟ་བུ་དག་ཡིན་ནོ། །
en: (69) Their torso resembles that of a lion.

source: སྐུའི་ཚིགས་ལེགས་པར་འབྲེལ་པ་དག་ཡིན་ནོ། །
en: (70) The joints of their bodies are well articulated.

source: སྤྱི་གཙུག་བ་ལྟར་མི་མངོན་པ་དག་ཡིན་ནོ། །
en: (71) The pinnacle of their crown cannot be seen.

source: དབུ་སྐྲ་མཐོན་ཏིང་ལ་འཇམ་ཞིང་རིང་བ་དག་ཡིན་ནོ། །
en: (72) The hair of their heads is bluish black, soft, and long.

source: དབུ་སྐྲ་མ་འཁྲུགས་པ་དག་ཡིན་ནོ། །
en: (73) The hair of their heads is not dishevelled.

source: དབུ་སྐྲ་གྱེན་དུ་ཕྱོགས་ཤིང་བཟང་ལ་ལྕང་ལོར་འཁྱིལ་བ་དག་ཡིན་ནོ། །
en: (74) The hairs of their heads point upwards, finely and curling into locks.

source: དབུ་སྐྲ་མ་འཛིངས་པ་དག་ཡིན་ནོ། །
en: (75) The hair of their heads is untangled.

source: ཐུགས་ཀར་དཔལ་གྱི་བེའུས་ལེགས་པར་བརྒྱན་པ་དང་ལྡན་པ་དག་ཡིན་ནོ། །
en: (76) Their hearts are excellently adorned with the śrīvatsa motif.

source: ཕྱག་དང་ཞབས་ཀྱི་མཚན་དཔལ་གྱིས་འབར་བ་དང་ལྡན་པ་དག་ཡིན་ནོ། །
en: (77) The markings on their palms and soles blaze with splendor.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མཚལ་དང་ལྡོང་རོས་དང་། ཙི་ན་བིཥྚ་དང་། མཐིང་ཤུན་དང་། ཟངས་གཡའི་ཁ་དོག་གིས་བྲིས་པ་ལྟ་བུའི་མཚན་རྣམས་དང་ལྡན་པ་ཡིན་ཏེ།
en: (78) The lord buddhas are endowed with markings, as if they were drawn in the colors of vermilion, realgar, minium, indigo bark, and verdigris.

source: དེ་དག་ནི་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཞེས་བྱའོ། །
en: “These are called the eighty minor marks.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པར་མི་བགྱི་ན། དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལགས་ཏེ། འདི་ལྟ་སྟེ་འདི་དག་ནི་དགེ་བའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་མི་དགེ་བའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ལུང་དུ་བསྟན་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ལུང་དུ་མ་བསྟན་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་རྣམས་མོ། །འདི་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ཟག་པ་དང་བཅས་པའི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ཟག་པ་མ་མཆིས་པའི་ཆོས་རྣམས་སོ། །
en: Then the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord, if great bodhisattva beings should not cultivate fixation on all these phenomena, consequently do bodhisattvas not consider all these things to be distinct?

source: འདི་དག་ནི་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ཐུན་མོང་གི་ཆོས་རྣམས་སོ། །འདི་དག་ནི་ཐུན་མོང་མ་ལགས་པའི་ཆོས་རྣམས་སོ་ཞེས་བགྱི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ན་བྱང་ཆུབ་ཀྱི་ལམ་ཇི་ལྟར་བསྒྲུབ་པར་བགྱིད་ལགས། མ་བསྒྲུབས་ན་ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་འཐོབ་པར་འགྱུར་ལགས།
en: That is to say, if bodhisattvas do not consider those phenomena that are virtuous, those that are non-virtuous, those that are specific, those that are non-specific, those that are mundane, those that are supramundane, those that are contaminated, those that are uncontaminated, those that are conditioned, those that are unconditioned, those that are common, and do not those that are uncommon, how then will the path of enlightenment be attained, and if it is not attained, how will omniscience be acquired?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་མཐོང་མོད་ཀྱི། དེ་ནི་ཀུན་རྫོབ་ཏུ་ཡིན་གྱི་དོན་དམ་པར་ནི་མ་ཡིན་ནོ། །
en: Then the Blessed One addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, bodhisattvas do perceive all such phenomena distinctly, but that pertains to the relative truth, not the ultimate truth.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཀུན་རྫོབ་ཏུ་ལགས་ཀྱི་དོན་དམ་པར་ནི་མ་ལགས།
en: “Reverend Lord, in what way does that pertain to the relative but not the ultimate truth?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་དེ་ལ་འཇིག་རྟེན་པའི་ཆོས་དགེ་བ་རྣམས་གང་ཡིན་སྙམ་དུ་སེམས་པ་ལས་དེ་འདི་སྙམ་དུ་འདི་ལྟ་སྟེ། ཕར་འཛིན་པ་དང་། མར་འཛིན་པ་དང་། དགེ་སྦྱོང་དུ་འཛིན་པ་དང་། བྲམ་ཟེར་འཛིན་པ་དང་། རིགས་ཀྱི་གཙོ་བོ་ལ་རིམ་གྲོ་བྱེད་པ་དང་། སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་།
en: he asked.

source: བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། ཞལ་ཏ་བྱེད་པ་དང་ལྡན་པའི་བསོད་ནམས་དང་། ཐབས་ལ་མཁས་པ་དང་ལྡན་པའི་བསོད་ནམས་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་དང་། འཇིག་རྟེན་པའི་རྣམ་པར་བམ་པའི་འདུ་ཤེས་དང་། རྣམ་པར་འབུས་གཞིགས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་དམར་བའི་འདུ་ཤེས་དང་། རྣམ་པར་རྣགས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་སྔོས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་ཟོས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་འཐོར་བའི་འདུ་ཤེས་དང་། རུས་གོང་གི་འདུ་ཤེས་དང་། རྣམ་པར་ཚིག་པའི་འདུ་ཤེས་དང་། དེ་བཞིན་དུ་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་དང་། ཉེ་བར་ཞི་བ་རྗེས་སུ་དྲན་པ་དང་། དབུགས་རྔུབ་པ་དང་། འབྱུང་བ་རྗེས་སུ་དྲན་པ་དང་། ལུས་སུ་རྟོགས་པ་རྗེས་སུ་དྲན་པ་དང་། འཆི་བ་རྗེས་སུ་དྲན་པ་སྟེ།
en: The Blessed One responded, “Śāradvatī­putra, whenever a bodhisattva considers which of those things constitute mundane virtuous phenomena, they include the following: respect for one’s father, respect for one’s mother, respect for a virtuous ascetic, respect for a brāhmin, acts of service undertaken on behalf of a clan chieftain, meritorious deeds originating from generosity, meritorious deeds originating from ethical discipline and meditation, merits endowed with service, merits endowed with skillful means, the paths associated with the ten virtuous actions, the mundane contemplation of a bloated corpse, the contemplation of a worm-infested corpse, the contemplation of a bloody corpse, the contemplation of a putrefied corpse, the contemplation of a blue-black corpse, the contemplation of a devoured corpse, the contemplation of a dismembered corpse, the contemplation of a skeleton, the contemplation of an immolated corpse, and likewise, the four meditative concentrations, the four immeasurable aspirations, the four formless meditative absorptions, the recollection of the Buddha, the recollection of the Dharma, the recollection of the Saṅgha, the recollection of ethical discipline, the recollection of renunciation, the recollection of the god realms, the recollection of quiescence, the recollection of respiration, and the recollection of death.

source: དེ་དག་ནི་འཇིག་རྟེན་པའི་དགེ་བའི་ཆོས་རྣམས་ཡིན་ནོ་སྙམ་དུ་སེམས་སོ། །དེ་ལ་མི་དགེ་བའི་ཆོས་རྣམས་གང་ཡིན་སྙམ་པ་ལས་དེ་འདི་སྙམ་དུ་འདི་ལྟ་སྟེ། སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཚིག་རྩུབ་པོ་དང་། ངག་འཁྱལ་བ་དང་། བརྣབ་སེམས་དང་།
en: These are considered to be mundane virtuous phenomena.

source: གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་དང་། ཁྲོ་བ་དང་། ཁོན་དུ་འཛིན་པ་དང་། འཆབ་པ་དང་། འཚིག་པ་དང་། རྣམ་པར་འཚེ་བ་དང་། ཕྲག་དོག་དང་། སེར་སྣ་དང་། ང་རྒྱལ་ཏེ།
en: “When a bodhisattva considers which things constitute non-virtuous phenomena, they include the following: the slaying of living creatures, theft, sexual misconduct, lying, slander, verbal abuse, irresponsible chatter, covetousness, malice, wrong views, anger, enmity, hypocrisy, annoyance, violence, jealousy, miserliness, and pride.

source: དེ་དག་ནི་མི་དགེ་བའི་ཆོས་རྣམས་ཡིན་ནོ་སྙམ་དུ་སེམས་སོ། །དེ་ལ་ལུང་དུ་མ་བསྟན་པའི་ཆོས་རྣམས་གང་ཡིན་སྙམ་པ་ལས། དེ་འདི་སྙམ་དུ་འདི་ལྟ་སྟེ། ལུས་ཀྱི་ལས་ལུང་དུ་མ་བསྟན་པ་དང་། ངག་གི་ལས་ལུང་དུ་མ་བསྟན་པ་དང་། ཡིད་ཀྱི་ལས་ལུང་དུ་མ་བསྟན་པ་དང་། འབྱུང་བ་ཆེན་པོ་བཞི་ལུང་དུ་མ་བསྟན་པ་དང་།
en: These are considered to be non-virtuous phenomena.

source: དབང་པོ་ལྔ་ལུང་དུ་མ་བསྟན་པ་དང་། ཕུང་པོ་ལྔ་ལུང་དུ་མ་བསྟན་པ་དང་། སྐྱེ་མཆེད་བཅུ་གཉིས་དང་། ཁམས་བཅྭ་བརྒྱད་དང་། རྣམ་པར་སྨིན་པ་སྟེ།
en: “When a bodhisattva considers which things constitute non-specific phenomena, they include the following: non-specific physical actions, non-specific verbal actions, non-specific mental actions, the non-specific four primary elements, the non-specific five sense organs, the non-specific five psycho-physical aggregates, the twelve sense fields, the eighteen sensory elements, and the maturation of past actions.

source: དེ་དག་ནི་ལུང་དུ་མ་བསྟན་པའི་ཆོས་རྣམས་ཡིན་ནོ་སྙམ་དུ་སེམས་སོ། །དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་གང་ཡིན་སྙམ་པ་ལས། དེ་འདི་སྙམ་དུ་འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་དང་། རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་དང་། མི་རྟོག་མི་དཔྱོད་པའི་ཏིང་ངེ་འཛིན་དང་། ནང་སྟོང་པ་ཉིད་ནས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: These are considered to be non-specific phenomena.

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དེ།
en: “When a bodhisattva considers which things constitute supramundane phenomena, they include the following: the four applications of mindfulness, the four correct exertions, the four supports for miraculous abilities, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the three gateways to liberation, the faculties that will enable knowledge of all that is unknown, the faculties that acquire the knowledge of all things, the faculties endowed with the knowledge of all things, the meditative stability endowed with ideation and scrutiny, the meditative stability free from ideation and merely endowed with scrutiny, the meditative stability free from both ideation and scrutiny, the [eighteen] aspects of emptiness (starting from the emptiness of internal phenomena and ending with the emptiness of the essential nature of non-entities), the ten powers of the tathāgatas, the four assurances, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: དེ་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ཡིན་ནོ་སྙམ་དུ་སེམས་སོ། །
en: These are considered to be supramundane phenomena.

source: དེ་ལ་ཟག་པ་དང་བཅས་པའི་ཆོས་རྣམས་གང་ཞེ་ན། ཁམས་གསུམ་དུ་གཏོགས་པའི་ཕུང་པོ་ལྔ་དང་། སྐྱེ་མཆེད་བཅུ་གཉིས་དང་། ཁམས་བཅྭ་བརྒྱད་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་སྟེ།
en: “Then, if you ask what constitutes contaminated phenomena, they include the following: the five psycho-physical aggregates which are encompassed in the three world systems, the twelve sense fields, the eighteen sensory elements, the four meditative concentrations, the four immeasurable aspirations, and the four formless meditative absorptions.

source: དེ་དག་ནི་ཟག་པ་དང་བཅས་པའི་ཆོས་རྣམས་ཞེས་བྱའོ། །
en: These are called contaminated phenomena.

source: དེ་ལ་ཟག་པ་མེད་པའི་ཆོས་རྣམས་གང་ཞེ་ན། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་སྟེ།
en: “If you ask what constitutes uncontaminated phenomena, they include the following: the four applications of mindfulness, and likewise all those [aforementioned causal and fruitional] attributes, up to and including the eighteen distinct qualities of the buddhas.

source: དེ་དག་ནི་ཟག་པ་མེད་པའི་ཆོས་རྣམས་ཡིན་ནོ། །དེ་ལ་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: These are uncontaminated phenomena.

source: འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་དང་། དེ་བཞིན་དུ་ཕུང་པོ་ལྔ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ནས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་བར་བྱ་སྟེ།
en: “If you ask what constitutes conditioned phenomena, they include the following: the world system of desire, the world system of form, the world system of formlessness, and likewise, the five psycho-physical aggregates, the four meditative concentrations, the four immeasurable aspirations, the four formless meditative absorptions, and similarly, all those [aforementioned] attributes extending from the four applications of mindfulness, up to and including the eighteen distinct qualities of the buddhas.

source: དེ་དག་ནི་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ཡིན་ནོ། །དེ་ལ་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་གང་ཞེ་ན།
en: These constitute conditioned phenomena.

source: ཆོས་གང་དག་ལ་སྐྱེ་བ་མེད་པ་དང་། གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པ་དང་། གཞན་དུ་འགྱུར་བ་མེད་པ་དང་། དེ་བཞིན་དུ་འདོད་ཆགས་ཟད་པ་དང་། ཞེ་སྡང་ཟད་པ་དང་། གཏི་མུག་ཟད་པ་དང་། དེ་བཞིན་དུ་ཆོས་གནས་པ་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་།
en: “If you ask what constitutes unconditioned phenomena, they include the following: Non-arising, non-abiding, non-disintegration, and non-transformation with respect to all things, and similarly, the cessation of desire, the cessation of hatred, the cessation of delusion, the abiding of phenomena in the real nature, reality, the expanse of reality, maturity with respect to all things, the real nature, the unmistaken real nature, the inalienable real nature, and the finality of existence.

source: ཡང་དག་པའི་མཐའ་སྟེ། དེ་དག་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱའོ། །
en: These are called unconditioned phenomena.

source: དེ་ལ་ཐུན་མོང་བའི་ཆོས་རྣམས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་སྟེ།
en: “If you ask what constitutes common phenomena, they include the following: the four meditative concentrations, the four immeasurable aspirations, the four formless meditative absorptions, and the [first] five extrasensory powers.

source: དེ་དག་ནི་སོ་སོའི་སྐྱེ་བོ་རྣམས་དང་། ཐུན་མོང་གི་ཆོས་རྣམས་ཡིན་ནོ། །དེ་ལ་སོ་སོའི་སྐྱེ་བོ་རྣམས་དང་། ཐུན་མོང་མ་ཡིན་པའི་ཆོས་རྣམས་གང་ཞེ་ན། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་།
en: These are common phenomena from the perspective of ordinary persons.

source: སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་སྟེ།
en: “If you ask what constitutes uncommon phenomena from the perspective of ordinary persons, they include the following: the thirty-seven aspects of enlightenment, the ten powers of the tathāgatas, the four assurances, the four kinds of exact knowledge, the three gateways to liberation, and [all the aforementioned attributes], up to and including the eighteen distinct qualities of the buddhas.

source: དེ་དག་ནི་ཐུན་མོང་མ་ཡིན་པའི་ཆོས་རྣམས་ཞེས་བྱ་སྟེ།
en: These are called uncommon phenomena.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་ཀུན་རྫོབ་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་མཐོང་མོད་ཀྱི། དོན་དམ་པར་ནི་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཇི་ལྟར་མངོན་པར་ཞེན་པར་མི་བྱེད་ཅེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་མི་ལ་ལ་ཞིག་གིས་སྒྱུ་མ་སྤྲུལ་པའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་འདི་ལྟ་སྟེ།
en: “Śāradvatī­putra, although bodhisattvas see all these phenomena distinctly from the perspective of the relative truth, they do not become fixated on them as ultimately real.

source: གླང་པོ་ཆེའི་ཚོགས་དང་། རྟ་བའི་ཚོགས་དང་། ཤིང་རྟའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་ཤིག་མཐོང་ན། དེ་ལ་དཔུང་གི་ཚོགས་ཡིན་ནོ་སྙམ་དུ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: If you ask in what way they do not become fixated, Śāradvatī­putra, it is as if someone were to see the corps of elephants, cavalry, chariots, and infantry without becoming fixated on the notion, ‘This is an army.’

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་མཐོང་མཐོང་མོད་ཀྱི། མངོན་པར་ཞེན་པར་ནི་མི་བྱེད་དོ། །
en: Śāradvatī­putra, in the same way, great bodhisattva beings perceive all phenomena distinctly, but do not become fixated on them.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་མི་ལ་ལ་ཚ་བས་གདུངས་པ་ཞིག་གིས་སྨིག་རྒྱུ་རྣམ་པ་སྣ་ཚོགས་དབའ་རླབས་འདྲ་བར་གཡོ་བ་མཐོང་ན། འདི་ནི་ཆུ་ཡིན་ནོ་སྙམ་དུ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་མཐོང་མོད་ཀྱི་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, just as when someone afflicted by intense heat perceives various mirage-like images, moving in the manner of waves, but does not become fixated on the notion that this mirage is actually water, in the same way, Śāradvatī­putra, great bodhisattva beings perceive all things distinctly but do not become fixated on them.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་མི་ལ་ལ་ཞིག་གིས་རྨི་ལམ་ན་གཟུགས་རྣམ་པ་སྣ་ཚོགས་པ་དག་མཐོང་ཡང་སད་ནས་དེ་དག་གི་གཟུགས་ཡིན་ནོ་སྙམ་དུ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་མཐོང་མོད་ཀྱི་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, just as when someone perceives diverse visual imagery in a dream, but on awakening does not become fixated on the notion that that visual imagery actually exists, in the same way, Śāradvatī­putra, great bodhisattva beings perceive all things distinctly but do not become fixated on them.”

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་མི་ལ་ལ་ཞིག་གིས་ཆུའི་ནང་ན་ཟླ་བ་མཐོང་ན་དེ་དེ་ལ་ཟླ་བ་ཡིན་ནོ་སྙམ་དུ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་མཐོང་མོད་ཀྱི་ཆོས་ཐམས་ཅད་ལ་དངོས་པོར་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, just as when someone perceives the moon reflected in water, but does not become fixated on the notion that these reflections are actually the moon, in the same way, Śāradvatī­putra, great bodhisattva beings perceive all things distinctly but do not become fixated on all things as entities.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་མི་ལ་ལ་ཞིག་གིས་མིག་ཡོར་མཐོང་ན་དེ་དེ་ལ་དངོས་པོར་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ལ་ཐ་དད་པར་མཐོང་མོད་ཀྱི། ཆོས་ཐམས་ཅད་ལ་དངོས་པོར་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, just as when someone perceives an optical aberration, but does not become fixated on these perceptions as entities, in the same way, Śāradvatī­putra, great bodhisattva beings perceive all things distinctly but do not become fixated on all things as entities.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་མི་ལ་ལ་ཞིག་གིས་རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལ་འགྲོ་ཡང་དེ་ལ་ནམ་མཁའོ་སྙམ་དུ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་དཔྱད་ན། ཆོས་དེ་དག་ཐམས་ཅད་ཉིད་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, just as when someone moves through space by the power of miraculous abilities, but does not become fixated on the notion that this is space, in the same way, Śāradvatī­putra, when great bodhisattva beings investigate all things, they do not become fixated on the entirety of these phenomena.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་མི་ལ་ལ་ཞིག་གིས་བྲག་ཅའི་སྒྲ་ཐོས་ན་སྒྲ་ཡིན་ནོ་སྙམ་དུ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ལ་ཐ་དད་པར་མཐོང་མོད་ཀྱི་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, just as when someone hears the sound of an echo, but does not become fixated on the notion that this is sound, in the same way, Śāradvatī­putra, great bodhisattva beings perceive all things distinctly, but they do not become fixated on them.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་མི་ལ་ལ་ཞིག་གིས་དྲི་ཟའི་གྲོང་ཁྱེར་མཐོང་ན་དེ་དེ་ལ་གྲོང་ཁྱེར་ཡིན་ནོ་སྙམ་དུ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ལ་ཐ་དད་པར་མཐོང་མོད་ཀྱི་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, just as when someone sees a gandharva castle in the sky, but does not become fixated on the notion that this is actually a castle, in the same way, Śāradvatī­putra, great bodhisattva beings perceive all things distinctly, but they do not become fixated on them.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་མི་ལ་ལ་ཞིག་གིས་མེ་ལོང་གི་ནང་དུ་བཞིན་གྱི་གཟུགས་བརྙན་མཐོང་ན་འདི་བཞིན་ཡིན་ནོ་སྙམ་དུ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་མཐོང་མོད་ཀྱི་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, just as when someone sees the reflection of their face in a mirror, but does not become fixated on the notion that it is actually their face, in the same way, Śāradvatī­putra, great bodhisattva beings perceive all phenomena distinctly, but they do not become fixated on them.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཐ་དད་པར་མཐོང་མཐོང་མོད་ཀྱི། ཆོས་དེ་དག་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: “Śāradvatī­putra, it is in this manner that great bodhisattva beings perceive all things distinctly, but do not become fixated on those phenomena.

source: ཆོས་རྣམས་ལ་མངོན་པར་མ་ཞེན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཡིན་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།།
en: One who is without fixation on anything will reach the transcendent perfection of wisdom, and swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས། ཆོས་ཐམས་ཅད་ཀྱི་ལེའུ་ཞེས་བྱ་སྟེ་གཉིས་པའོ།། །།
en: This completes the second chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “All Phenomena.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཞེན་པ་གང་ལགས།
en: Non-fixation Chapter 3 Then, the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord, what is the fixation of a bodhisattva?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་ལྟ་བ་ཡོངས་སུ་འཛིན་པ་དང་། སེམས་རྣམ་པར་རྨོངས་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་ཞེན་པ་ཞེས་བྱའོ། །གསོལ་པ།
en: The Blessed One replied, “Śāradvatī­putra, fixation denotes the views that bodhisattvas might adopt with regard to all things, and the deluded mindsets which they might have.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཐམས་ཅད་ལ་ལྟ་བ་ཡོངས་སུ་འཛིན་པ་གང་ལགས།
en: Then he asked, “Lord, what views might great bodhisattva beings adopt with respect to all things?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དང་། འཕགས་པའི་བདེན་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་ལྟ་བ་གང་ཡིན་པ་དང་། དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: The Blessed One replied, “Śāradvatī­putra, there are views that concern the psycho-physical aggregates, the sensory elements, the sense fields, the noble truths, and dependent origination.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པར་ལྟ་བ་དང་།
en: Similarly, there are views concerning the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, and liberation.

source: བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པར་ལྟ་བ་དང་། དེ་བཞིན་དུ་འདུ་ཤེས་སུ་ལྟ་བ་དང་།
en: Similarly, there are views concerning the meditative concentrations, the immeasurable aspirations, and the formless absorptions.
